----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1       [-1, 16, 2366, 2366]             416
         LeakyReLU-2       [-1, 16, 2366, 2366]               0
       BatchNorm2d-3       [-1, 16, 2366, 2366]              32
            Conv2d-4         [-1, 32, 788, 788]          12,832
         MaxPool2d-5         [-1, 32, 393, 393]               0
         LeakyReLU-6         [-1, 32, 393, 393]               0
       BatchNorm2d-7         [-1, 32, 393, 393]              64
            Conv2d-8         [-1, 64, 131, 131]          51,264
         MaxPool2d-9           [-1, 64, 65, 65]               0
        LeakyReLU-10           [-1, 64, 65, 65]               0
      BatchNorm2d-11           [-1, 64, 65, 65]             128
           Conv2d-12          [-1, 128, 21, 21]         204,928
        MaxPool2d-13          [-1, 128, 10, 10]               0
        LeakyReLU-14          [-1, 128, 10, 10]               0
      BatchNorm2d-15          [-1, 128, 10, 10]             256
          Encoder-16          [-1, 128, 10, 10]               0
  ConvTranspose2d-17           [-1, 64, 21, 21]         204,864
             ReLU-18           [-1, 64, 21, 21]               0
      BatchNorm2d-19           [-1, 64, 21, 21]             128
         Upsample-20           [-1, 64, 42, 42]               0
  ConvTranspose2d-21           [-1, 32, 82, 82]          32,800
             ReLU-22           [-1, 32, 82, 82]               0
  ConvTranspose2d-23         [-1, 16, 163, 163]          12,816
             ReLU-24         [-1, 16, 163, 163]               0
      BatchNorm2d-25         [-1, 16, 163, 163]              32
         Upsample-26         [-1, 16, 326, 326]               0
  ConvTranspose2d-27          [-1, 1, 650, 650]             257
             ReLU-28          [-1, 1, 650, 650]               0
          Decoder-29          [-1, 1, 650, 650]               0
             Tanh-30          [-1, 1, 650, 650]               0
  ConvTranspose2d-31           [-1, 64, 21, 21]         204,864
             ReLU-32           [-1, 64, 21, 21]               0
      BatchNorm2d-33           [-1, 64, 21, 21]             128
         Upsample-34           [-1, 64, 42, 42]               0
  ConvTranspose2d-35           [-1, 32, 82, 82]          32,800
             ReLU-36           [-1, 32, 82, 82]               0
  ConvTranspose2d-37         [-1, 16, 163, 163]          12,816
             ReLU-38         [-1, 16, 163, 163]               0
      BatchNorm2d-39         [-1, 16, 163, 163]              32
         Upsample-40         [-1, 16, 326, 326]               0
  ConvTranspose2d-41          [-1, 1, 650, 650]             257
             ReLU-42          [-1, 1, 650, 650]               0
          Decoder-43          [-1, 1, 650, 650]               0
          Sigmoid-44          [-1, 1, 650, 650]               0
================================================================
Total params: 771,714
Trainable params: 771,714
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 192.30
Forward/backward pass size (MB): 2410.92
Params size (MB): 2.94
Estimated Total Size (MB): 2606.16
----------------------------------------------------------------