----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 8, 499, 499]             136
         MaxPool2d-2          [-1, 8, 249, 249]               0
              GELU-3          [-1, 8, 249, 249]               0
       BatchNorm2d-4          [-1, 8, 249, 249]              16
            Conv2d-5         [-1, 16, 123, 123]           2,064
              GELU-6         [-1, 16, 123, 123]               0
       BatchNorm2d-7         [-1, 16, 123, 123]              32
            Conv2d-8           [-1, 32, 60, 60]           8,224
         MaxPool2d-9           [-1, 32, 30, 30]               0
             GELU-10           [-1, 32, 30, 30]               0
      BatchNorm2d-11           [-1, 32, 30, 30]              64
           Conv2d-12           [-1, 64, 14, 14]          32,832
             GELU-13           [-1, 64, 14, 14]               0
      BatchNorm2d-14           [-1, 64, 14, 14]             128
           Conv2d-15            [-1, 128, 6, 6]         131,200
             GELU-16            [-1, 128, 6, 6]               0
      BatchNorm2d-17            [-1, 128, 6, 6]             256
          Encoder-18            [-1, 128, 6, 6]               0
  ConvTranspose2d-19           [-1, 64, 14, 14]         131,136
             GELU-20           [-1, 64, 14, 14]               0
      BatchNorm2d-21           [-1, 64, 14, 14]             128
  ConvTranspose2d-22           [-1, 32, 30, 30]          32,800
             GELU-23           [-1, 32, 30, 30]               0
      BatchNorm2d-24           [-1, 32, 30, 30]              64
  ConvTranspose2d-25           [-1, 16, 62, 62]           8,208
             GELU-26           [-1, 16, 62, 62]               0
      BatchNorm2d-27           [-1, 16, 62, 62]              32
  ConvTranspose2d-28          [-1, 1, 126, 126]             257
             GELU-29          [-1, 1, 126, 126]               0
      BatchNorm2d-30          [-1, 1, 126, 126]               2
           Conv2d-31          [-1, 1, 128, 128]               2
          Sigmoid-32          [-1, 1, 128, 128]               0
          Decoder-33          [-1, 1, 128, 128]               0
  ConvTranspose2d-34           [-1, 64, 14, 14]         131,136
             GELU-35           [-1, 64, 14, 14]               0
      BatchNorm2d-36           [-1, 64, 14, 14]             128
  ConvTranspose2d-37           [-1, 32, 30, 30]          32,800
             GELU-38           [-1, 32, 30, 30]               0
      BatchNorm2d-39           [-1, 32, 30, 30]              64
  ConvTranspose2d-40           [-1, 16, 62, 62]           8,208
             GELU-41           [-1, 16, 62, 62]               0
      BatchNorm2d-42           [-1, 16, 62, 62]              32
  ConvTranspose2d-43          [-1, 1, 126, 126]             257
             GELU-44          [-1, 1, 126, 126]               0
      BatchNorm2d-45          [-1, 1, 126, 126]               2
           Conv2d-46          [-1, 1, 128, 128]               2
          Sigmoid-47          [-1, 1, 128, 128]               0
          Decoder-48          [-1, 1, 128, 128]               0
================================================================
Total params: 520,210
Trainable params: 520,210
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3.81
Forward/backward pass size (MB): 40.24
Params size (MB): 1.98
Estimated Total Size (MB): 46.04
----------------------------------------------------------------